Data Reading

In [1]:
import pandas as pd

In [4]:
df=pd.read_csv("Placement_Data_Full_Class.csv")
df.head()

,sl_no,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status,salary
0,1,M,67.00,Others,91.00,Others,Commerce,58.00,Sci&Tech,No,55.0,Mkt&HR,58.80,Placed,270000.0
1,2,M,79.33,Central,78.33,Others,Science,77.48,Sci&Tech,Yes,86.5,Mkt&Fin,66.28,Placed,200000.0
2,3,M,65.00,Central,68.00,Central,Arts,64.00,Comm&Mgmt,No,75.0,Mkt&Fin,57.80,Placed,250000.0
3,4,M,56.00,Central,52.00,Central,Science,52.00,Sci&Tech,No,66.0,Mkt&HR,59.43,Not Placed,NaN
4,5,M,85.80,Central,73.60,Central,Commerce,73.30,Comm&Mgmt,No,96.8,Mkt&Fin,55.50,Placed,425000.0

In [6]:
df.sample(5)

,sl_no,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status,salary
98,99,F,69.0,Central,73.0,Central,Commerce,65.00,Comm&Mgmt,No,70.0,Mkt&Fin,57.31,Placed,220000.0
151,152,M,65.0,Central,65.0,Central,Commerce,75.00,Comm&Mgmt,No,83.0,Mkt&Fin,58.87,Placed,270000.0
157,158,M,66.5,Central,62.5,Central,Commerce,60.90,Comm&Mgmt,No,93.4,Mkt&Fin,55.03,Placed,300000.0
3,4,M,56.0,Central,52.0,Central,Science,52.00,Sci&Tech,No,66.0,Mkt&HR,59.43,Not Placed,NaN
188,189,M,61.8,Others,47.0,Others,Commerce,54.38,Comm&Mgmt,No,57.0,Mkt&Fin,56.13,Not Placed,NaN

In [11]:
df=df.loc[:, ['ssc_p', 'salary','etest_p']]

In [12]:
df.head(10)

   ssc_p    salary  etest_p
0  67.00  270000.0    55.00
1  79.33  200000.0    86.50
2  65.00  250000.0    75.00
3  56.00       NaN    66.00
4  85.80  425000.0    96.80
5  55.00       NaN    55.00
6  46.00       NaN    74.28
7  82.00  252000.0    67.00
8  73.00  231000.0    91.34
9  58.00       NaN    54.00